In [1]:
import pandas as pd
pd.__version__

'1.0.1'

In [2]:
data  = pd.DataFrame({'Country': ['Russia','Colombia','Chile','Equador','Nigeria'],'Rank':[121,40,100,130,11]})
data

    Country  Rank
0    Russia   121
1  Colombia    40
2     Chile   100
3   Equador   130
4   Nigeria    11

In [3]:
data.describe()

             Rank
count    5.000000
mean    80.400000
std     52.300096
min     11.000000
25%     40.000000
50%    100.000000
75%    121.000000
max    130.000000

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  5 non-null      object
 1   Rank     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [8]:
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [10]:
data.sort_values(by=['ounces'],ascending=True,inplace=False)

  group  ounces
1     a     3.0
6     c     3.0
0     a     4.0
7     c     5.0
3     b     6.0
8     c     6.0
4     b     7.5
5     b     8.0
2     a    12.0

In [12]:
data.sort_values(by=['group','ounces'],ascending=[True,False],inplace=False)

  group  ounces
2     a    12.0
0     a     4.0
1     a     3.0
5     b     8.0
4     b     7.5
3     b     6.0
8     c     6.0
7     c     5.0
6     c     3.0

In [13]:
data = pd.DataFrame({'k1':['one']*3 + ['two']*4,'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [14]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [15]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

In [16]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [23]:
meat_to_animal = {'bacon':'pig',
'pulled pork':'pig',
'pastrami':'cow',
'corned beef':'cow',
'honey ham':'pig',
'nova lox':'salmon'}

def meat_2_animal(series):
    if series['food'] =='bacon':
        return 'pig'
    elif series['food'] =='pulled pork':
        return 'pig'
    elif series['food'] =='pastrami':
        return 'cow'
    elif series['food'] =='corned beef':
        return 'cow'
    elif series['food'] =='honey ham':
        return 'pig'
    else:
        return 'salmon'  
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [30]:
data.assign(new_variable = data['ounces'] * 10)

          food  ounces  new_variable
0        bacon     4.0          40.0
1  pulled pork     3.0          30.0
2        bacon    12.0         120.0
3     Pastrami     6.0          60.0
4  corned beef     7.5          75.0
5        Bacon     8.0          80.0
6     pastrami     3.0          30.0
7    honey ham     5.0          50.0
8     nova lox     6.0          60.0

In [33]:
data.drop('ounces',axis='columns',inplace=True)
data

          food
0        bacon
1  pulled pork
2        bacon
3     Pastrami
4  corned beef
5        Bacon
6     pastrami
7    honey ham
8     nova lox

In [35]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [38]:
import numpy as np
data.replace(-999, np.nan,inplace = True)
data

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data.replace([-999,-1000],np.nan,inplace=True)
data

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),index=['ohio','colorado','new york'],columns=['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [42]:
data.rename(index={'ohio':'Sanf'},columns={'one':'one_p','two':'two_p'},inplace=True)
data

          one_p  two_p  three  four
Sanf          0      1      2     3
colorado      4      5      6     7
new york      8      9     10    11

In [46]:
data.rename(index=str.upper,columns=str.title,inplace=True)
data

          One_P  Two_P  Three  Four
SANF          0      1      2     3
COLORADO      4      5      6     7
NEW YORK      8      9     10    11

In [47]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [48]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [53]:
cats.labels

AttributeError: 'Categorical' object has no attribute 'labels'

In [54]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [57]:
bin_names = ['youth','youthAdult','Middleage','senior']
new_cats = pd.cut(ages,bins,labels=bin_names)

pd.value_counts(new_cats)

youth         5
Middleage     3
youthAdult    3
senior        1
dtype: int64

In [58]:
pd.value_counts(new_cats).cumsum()

youth          5
Middleage      8
youthAdult    11
senior        12
dtype: int64

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1':['a','a','b','b','a'],
    'key2':['one','two','one','two','one'],
    'data1': np.random.randn(5),
    'data2': np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.774869 -0.190990
1    a  two -0.450973 -0.476676
2    b  one -0.359792 -0.916291
3    b  two -0.398391 -0.923110
4    a  one  0.020048 -1.544372

In [7]:
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    0.447982
b   -0.379091
Name: data1, dtype: float64

In [8]:
dates = pd.date_range('20130101',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.058394  1.016169 -0.140440  1.268056
2013-01-02  1.626461 -1.643123 -1.173731  3.249342
2013-01-03 -0.011760 -0.289087  0.224616 -0.550197
2013-01-04 -0.248519  1.201780 -0.731941  1.112748
2013-01-05 -0.864786  0.455356  0.407000  0.504506
2013-01-06  1.342392  0.509093 -0.105951 -0.692790

In [9]:
df[ :3]

                   A         B         C         D
2013-01-01  0.058394  1.016169 -0.140440  1.268056
2013-01-02  1.626461 -1.643123 -1.173731  3.249342
2013-01-03 -0.011760 -0.289087  0.224616 -0.550197

In [11]:
df['20130104':'20130106']

                   A         B         C         D
2013-01-04 -0.248519  1.201780 -0.731941  1.112748
2013-01-05 -0.864786  0.455356  0.407000  0.504506
2013-01-06  1.342392  0.509093 -0.105951 -0.692790

In [15]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.058394  1.016169
2013-01-02  1.626461 -1.643123
2013-01-03 -0.011760 -0.289087
2013-01-04 -0.248519  1.201780
2013-01-05 -0.864786  0.455356
2013-01-06  1.342392  0.509093

In [16]:
df.loc['20130104':'20130106',['A','B']]

                   A         B
2013-01-04 -0.248519  1.201780
2013-01-05 -0.864786  0.455356
2013-01-06  1.342392  0.509093

In [18]:
df.iloc[3]

A   -0.248519
B    1.201780
C   -0.731941
D    1.112748
Name: 2013-01-04 00:00:00, dtype: float64

In [19]:
df.iloc[2:4,0:2]

                   A         B
2013-01-03 -0.011760 -0.289087
2013-01-04 -0.248519  1.201780

In [20]:
df.iloc[[1,5],[0,2]]

                   A         C
2013-01-02  1.626461 -1.173731
2013-01-06  1.342392 -0.105951

In [21]:
df[df.A > 1]

                   A         B         C         D
2013-01-02  1.626461 -1.643123 -1.173731  3.249342
2013-01-06  1.342392  0.509093 -0.105951 -0.692790

In [22]:
df2 = df.copy()
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.058394  1.016169 -0.140440  1.268056    one
2013-01-02  1.626461 -1.643123 -1.173731  3.249342    one
2013-01-03 -0.011760 -0.289087  0.224616 -0.550197    two
2013-01-04 -0.248519  1.201780 -0.731941  1.112748  three
2013-01-05 -0.864786  0.455356  0.407000  0.504506   four
2013-01-06  1.342392  0.509093 -0.105951 -0.692790  three

In [23]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.011760 -0.289087  0.224616 -0.550197   two
2013-01-05 -0.864786  0.455356  0.407000  0.504506  four

In [24]:
df2[~df2['E'].isin(['two','four'])]

                   A         B         C         D      E
2013-01-01  0.058394  1.016169 -0.140440  1.268056    one
2013-01-02  1.626461 -1.643123 -1.173731  3.249342    one
2013-01-04 -0.248519  1.201780 -0.731941  1.112748  three
2013-01-06  1.342392  0.509093 -0.105951 -0.692790  three

In [26]:
df.query('A > C')

                   A         B         C         D
2013-01-01  0.058394  1.016169 -0.140440  1.268056
2013-01-02  1.626461 -1.643123 -1.173731  3.249342
2013-01-04 -0.248519  1.201780 -0.731941  1.112748
2013-01-06  1.342392  0.509093 -0.105951 -0.692790

In [27]:
df.query('A < B | C > A')

                   A         B         C         D
2013-01-01  0.058394  1.016169 -0.140440  1.268056
2013-01-03 -0.011760 -0.289087  0.224616 -0.550197
2013-01-04 -0.248519  1.201780 -0.731941  1.112748
2013-01-05 -0.864786  0.455356  0.407000  0.504506

In [28]:
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],'ounces' : ['4','3','12','6','7.5','8','3','5','6']})
data

  group ounces
0     a      4
1     a      3
2     a     12
3     b      6
4     b    7.5
5     b      8
6     c      3
7     c      5
8     c      6

In [29]:
data.pivot_table(values='ounces',index='group',aggfunc='count')

       ounces
group
a           3
b           3
c           3